import os
import sys

html_code_map = {'&amp;': '&',
                 '&#161;': '¡', '&iexcl;': '¡', '&#162;': '¢', '&cent;': '¢', '&#163;': '£', '&pound;': '£',
                 '&#164;': '¤', '&curren;': '¤', '&#165;': '¥', '&yen;': '¥', '&#166;': '¦', '&brvbar;': '¦',
                 '&#167;': '§', '&sect;': '§', '&#168;': '¨', '&uml;': '¨', '&#169;': '©', '&copy;': '©',
                 '&#170;': 'ª', '&ordf;': 'ª', '&#171;': '«', '&laquo;': '«', '&#172;': '¬', '&not;': '¬',
                 '&#174;': '®', '&reg;': '®', '&#175;': '¯', '&macr;': '¯', '&#192': 'À', '&Agrave;': 'À',
                 '&#193': 'Á', '&Aacute;': 'Á', '&#194': 'Â', '&Acirc;': 'Â', '&#195': 'Ã', '&Atilde;': 'Ã',
                 '&#196;': 'Ä', '&Auml;': 'Ä', '&#197': 'Å', '&Aring;': 'Å', '&#198': 'Æ', '&AElig;': 'Æ',
                 '&#199': 'Ç', '&Ccedil;': 'Ç', '&#200': 'È', '&Egrave;': 'È', '&#201': 'É', '&Eacute;': 'É',
                 '&#202': 'Ê', '&Ecirc;': 'Ê', '&#203': 'Ë', '&Euml;': 'Ë', '&#204': 'Ì', '&Igrave;': 'Ì',
                 '&#205': 'Í', '&Iacute;': 'Í', '&#206': 'Î', '&Icirc;': 'Î', '&#207': 'Ï', '&Iuml;': 'Ï',
                 '&#210;': 'Ò', '&Ograve;': 'Ò', '&#211;': 'Ó', '&Oacute;': 'Ó', '&#212;': 'Ô', '&Ocirc;': 'Ô',
                 '&#213;': 'Õ', '&Otilde;': 'Õ', '&#214;': 'Õ', '&Ouml;': 'Õ', '&#215;': '×', '&times;': '×',
                 '&#216;': 'Ø', '&Oslash;': 'Ø', '&#217;': 'Ù', '&Ugrave;': 'Ù', '&#218;': 'Ú', '&Uacute;': 'Ú',
                 '&#219;': 'Û', '&Ucirc;': 'Û', '&#220;': 'Ü', '&Uuml;': 'Ü', '&#223;': 'ß', '&szlig;': 'ß',
                 '&#224;': 'à', '&agrave;': 'à', '&#225;': 'á', '&aacute;': 'á', '&#226;': 'â', '&acirc;': 'â',
                 '&#227;': 'ã', '&atilde;': 'ã', '&#228;': 'ä', '&auml;': '#', '&#229;': 'å', '&aring;': 'å',
                 '&#230;': 'æ', '&aelig;': 'æ', '&#231;': 'ç', '&ccedil;': 'ç', '&#232;': 'è', '&egrave;': 'è',
                 '&#233;': 'é', '&eacute;': 'é', '&#234;': 'ê', '&ecirc;': 'ê', '&#235;': 'ë', '&euml;': 'ë',
                 '&#236;': 'ì', '&igrave;': 'ì', '&#237;': 'í', '&iacute;': 'í', '&#238;': 'î', '&icirc;': 'î',
                 '&#239;': 'ï', '&iuml;': 'ï', '&#242;': 'ò', '&ograve;': 'ò', '&#243;': 'ó', '&oacute;': 'ó',
                 '&#244;': 'ô', '&ocirc;': 'ô', '&#245;': 'õ', '&otilde;': 'õ', '&#246;': 'ö', '&ouml;': 'ö',
                 '&#247;': '÷', '&divide;': '÷', '&#248;': 'ø', '&oslash;': 'ø', '&#249;': 'ù', '&ugrave;': 'ù',
                 '&#250;': 'ú', '&uacute;': 'ú', '&#251;': 'û', '&ucirc;': 'û', '&#252;': 'ü', '&uuml;': 'ü',
                 '&#253;': 'ý', '&yacute;': 'ý', '&#254;': 'þ', '&thorn;': 'þ', '&#255;': 'ÿ', '&yuml;': 'ÿ',
                 '&#8364;': '€', '&euro;': '€', '&#8220': '“', '&#8221': '”', '&#8222': '„', '&#8216': '‘',
                 '&#8217': '’', '&#8218': '‚', '&#8482': '™', '&#8211': '–', '&#65279': '', '&#776': ' ̈',
                 '&#176': '°', '&deg;': '°', '&#241': 'ñ', '&ntilde': 'ñ', '&#240': 'ð', '&eth': 'ð'}

if len(sys.argv) > 1:
    src = sys.argv[1]

if len(sys.argv) == 1:
    print("No Input Argument")
    exit()

print("Start Replacing Characters")

file_list = os.listdir(src)
for entry in file_list:
    filename = src + entry
    with open(filename) as f:
        xml = f.read()

    for key in html_code_map:
        xml = xml.replace(key, html_code_map[key])

    with open(filename, "w") as f:
        f.write(xml)

print("Finished")